Repository: lipetsk-digital/HomeLibraryAI
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# no_books
source: Where is no books in your library 🥺
ru: Пока нет книг в библиотеке 🥺

# {result}_book
source: You have {result} book 📕 in your library
ru: У вас {result} книга 📕 в библиотеке

# no_books_found
source: Sorry, no books found 🥺
ru: Книги не найдены 🥺

# {books}_found
source: {books} book 📕 found:
ru: Найдена {books} книга 📕:

source: ✏️ Edit
ru: ✏️ Правка

# add
source: ➕ Add book
ru: ➕ Добавить книгу

source: 🔍 Search
ru: 🔍 Найти

# rename
source: ⚠️ Rename category
ru: ⚠️ Переименовать категорию

source: 📨 Export
ru: 📨 Экспорт

source: ⚙️ Settings
ru: ⚙️ Настройки

# recent
source: 🕓 Recently added
ru: 🕓 Недавние

# cat
source: 🗂️ Cathegories
ru: 🗂️ Категории

source: Cancel
ru: Отмена

# use_cover
source: ✅ OK, use this cover
ru: ✅ Да, использовать эту обложку

# use_original_photo
source: 🖼️ No, use original photo
ru: 🖼️ Нет, использовать оригинальное фото

# take_new_photo
source: 📷 Stop, take a new photo
ru: 📷 Стоп, сделать новое фото

source: 📗 Title
ru: 📗 Название

# authors_full_names
source: 🧑‍🎨 Author
ru: 🧑‍🎨 Автор

source: 📄 Pages
ru: 📄 Страниц

source: 🏤 Publisher
ru: 🏤 Издательство

source: 📅 Year
ru: 📅 Год

source: ⏱️ Brief
ru: ⏱️ Кратко

# authors
source: 🧑‍🎨 Author (abbr.)
ru: 🧑‍🎨 Автор (сокр.)

source: 📜 Annotation
ru: 📜 Аннотация

source: #️⃣ Book ID
ru: #️⃣ ID книги

source: 📂 Category
ru: 📂 Категория

# move_book
source: Move 📁
ru: Переместить 📁

# delete_book
source: Delete 🗑️
ru: Удалить ❌

# save_changes
source: ✅ Save
ru: ✅ Cохранить

# prompt_photo
source: The photo contains a page with the book's annotation.
ru: На фотографии страница с аннотацией к книге.

# prompt_result
source: Your response should only consist of the [book] section of an ini file without any introductory or concluding phrases.
ru: Твой ответ должен представлять собой только секцию [book] ini-файла без вводных и заключительных фраз.

# prompt_count
source: The section must always contain 9 parameters. If a parameter is missing, its value should be empty.
ru: В секции всегда должно быть 9 параметров. Если какого-то параметра нет, то его значение должно быть пустым.

# prompt_lang
source: Provide the parameter values in the same language as the photographed page.
ru: Значения параметоров приводи на том же языке, что и сфотографированная страница.

# prompt_characters
source: If the parameter value contains newlines or equal signs, replace them with spaces.
ru: Если значение параметра содержит символы перевода строки или знаки равенства - замени их на пробелы.

# prompt_plaintext
source: Output only plain text of ini file content. Do not output markdown.
ru: Выводи содержимое ini-флайла в виде обычного текста. Не используй язык разметки markdown.

# prompt_fields
source: Below are the names of each parameter and the extracted information from the image that its value should contain:
ru: Ниже приведены названия каждого параметра и выделенная из изображения информация, которую должно содержать его значение:

# prompt_title
source: title - the title of the book
ru: title - название книги

# prompt_authors
source: authors - the authors of the book
ru: authors - авторы книги. Не включай сюда составителей, иллюстраторов, редакторов, авторов рецезий или предисловий, только авторов текста книги

# prompt_pages
source: pages - the number of pages
ru: pages - количество страниц

# prompt_publisher
source: publisher - the publishing house
ru: publisher - издательство

# prompt_year
source: year - the year of publication
ru: year - год издания

# prompt_isbn
source: isbn - the ISBN code
ru: isbn - код ISBN

# prompt_annotation
source: annotation - the full text of the annotation exactly as it appears on the photographed page
ru: annotation - заново весь полный текст всей аннотации, дословно приведённый на фотографии страницы

# prompt_brief
source: brief - rephrase the annotation field: formulate a single sentence that best conveys the content of the book
ru: brief - перефразируй поле annotation: сформулируй на его основе одно предложение, лучшим образом раскрывающее содержание книги

# prompt_authors_full_names
source: authors_full_names - full names, surnames, and (if applicable) patronymics of all authors of the book from the authors field. The page likely contains mentions of their full names. Find and provide them in this field
ru: authors_full_names - полные имена, фамилии и (при наличии) отчества всех авторов книги из поля authors. На странице наверняка есть упоминания их полных имён. Найди и приведи их в этом поле

# use_brief
source: ✅ All right
ru: ✅ Всё верно

# edit_brief
source: ✏️ Edit
ru: ✏️ Редактировать

# add_another_book
source: ➕ Add
ru: ➕ Добавить

# no_another_book
source: ❌ No
ru: ❌ Не нужно

# delete
source: 🗑️ Delete book
ru: 🗑️ Удалить

# upload_failed
source: Sorry, the upload failed 🥺
ru: Извините, загрузка не удалась 🥺

# wait
source: ⏳ Please wait, the AI is processing your photo...
ru: ⏳ Пожалуйста, подождите, ИИ обрабатывает фотографию...

# gpt_failed
source: Sorry, AI request failed 🥺
ru: ИИ недоступен 🥺

# gpt_incorrect
source: Sorry, the AI response is incorrect 🥺
ru: ИИ выдал что-то неопнятное 🥺

# {bookid}_added
source: 📗 The book has been saved in the library under the number {bookid}.
ru: 📗 Книга сохранена в библиотеку под номером {bookid}.

# add_next_{category}
source: Add the next book to the {category} category?
ru: Добавить следующую книгу в категорию {category}?

# select_or_enter_category_add_book
source: Select 📂 category for adding a new book or enter the name of new category:
ru: ➕ Выберите 📂 категорию, в которую добавить новую книгу или введите название новой категории:

# select_category_to_view_books
source: Select 📂 category to see the books:
ru: Выберите 📂 категорию, чтобы посмотреть книги:

source: Select 📂 category to rename:
ru: Выберите 📂 категорию, которую нужно переименовать:

# select_category_to_move_book
source: Select 📂 category to move the book or enter the name of new category:
ru: Выберите 📂 категорию, в которую перенести книгу или напишите название новой категории:

# enter_category_add_book
source: Enter name of 📂 category for adding a new book:
ru: Напишите название 📂 категории, в которую добавить новую книгу:

# category_name_{size}
source: The category name is too long 🥺 (maximum {size} bytes)
ru: Слишком длинное название категории 🥺 (максимум {size} байт)

# can_not_add_category
source: 🫸 You cannot add a new category at this moment. Please select an existing one
ru: 🫸 Сейчас невозможно добавить новую категорию. Пожалуйста, выберите одну из существующих

# category_renamed
source: ✅ Category renamed successfully
ru: ✅ Категория успешно переименована

# photo_cover
source: Take a photo of the book cover 📸
ru: Сфотографируйте обложку книги 📸

# contour_failed
source: Sorry, book detection failed 🥺
ru: Извините, не удалось найти книгу на фото 🥺

# remove_background_failed
source: Sorry, the background removal failed 🥺
ru: Извините, не удалось удалить фон 🥺

# select_field
source: ❔Select the field to edit:
ru: ❔Выберите поле для редактирования:

# confirm_delete_book
source: 🗑️ Delete book?
ru: 🗑️ Удалить книгу?

# {bookid}_updated
source: 📗 The book {bookid} has been updated
ru: ✅ Книга {bookid} обновлена

# edit_field_value
source: copy current field value and correct it or write a new one:
ru: cкопируйте текущее значение поля и исправьте его или напишите новое:

# edit_field_empty
source: write a new value:
ru: напишите новое значение поля:

# book_not_found
source: Sorry, book not found 🥺
ru: Книга не найдена 🥺

# {bookid}_deleted
source: 🗑️ The book {bookid} has been deleted
ru: 🗑️ Книга {bookid} удалена

# select_lang
source: Select language:
ru: Выберите язык / Select language:

# {language}_selected
source: You selected {language} language
ru: Вы выбрали {language} язык

# enter_search_query
source: 🔍 Enter worlds of a book title, its authors or its ID:
ru: 🔍 Введите слова из названия книги, её авторов, часть isbn, её id или выберите кнопку:
